# Creating a Series

In [ ]:

import pandas as pd
data=[1,22,3,4]
df=pd.Series(data)
print(df)

0     1
1    22
2     3
3     4
dtype: int64

# Creating a DataFrame

In [2]:
import pandas as pd
data={"Marks":[15,13,12],
     "Subject":["DA","Cloud Computing","Machine Learning"]
     }
df=pd.DataFrame(data,index=["CS013","CS002","BM012"])
print(df)

       Marks           Subject
CS013     15                DA
CS002     13   Cloud Computing
BM012     12  Machine Learning

In [3]:
data = {
 'Name': ['Alice', 'Bob', 'Charlie'],
 'Age': [25, 30, 35],
 'City': ['New York', 'Los Angeles', 'Chicago']
}
df = pd.DataFrame(data)
print(df)

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

# Reading Data from Files
# Viewing the Data

In [4]:

import pandas as pd
df=pd.read_csv("transactions.csv")
print(df.head(10))

   TransactionID TransactionDate  UserID  ProductID  Quantity
0              1      2010-08-21     7.0          2         1
1              2      2011-05-26     3.0          4         1
2              3      2011-06-16     3.0          3         1
3              4      2012-08-26     1.0          2         3
4              5      2013-06-06     2.0          4         1
5              6      2013-12-23     2.0          5         6
6              7      2013-12-30     3.0          4         1
7              8      2014-04-24     NaN          2         3
8              9      2015-04-24     7.0          4         3
9             10      2016-05-08     3.0          4         4

In [5]:
print(df.tail())

   TransactionID TransactionDate  UserID  ProductID  Quantity
5              6      2013-12-23     2.0          5         6
6              7      2013-12-30     3.0          4         1
7              8      2014-04-24     NaN          2         3
8              9      2015-04-24     7.0          4         3
9             10      2016-05-08     3.0          4         4

In [6]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   TransactionID    10 non-null     int64
 1   TransactionDate  10 non-null     object
 2   UserID           9 non-null      float64
 3   ProductID        10 non-null     int64
 4   Quantity         10 non-null     int64
dtypes: float64(1), int64(3), object(1)
memory usage: 532.0+ bytes
None

In [7]:
print(df.describe())

       TransactionID    UserID  ProductID   Quantity
count       10.00000  9.000000  10.000000  10.000000
mean         5.50000  3.444444   3.400000   2.400000
std          3.02765  2.127858   1.074968   1.712698
min          1.00000  1.000000   2.000000   1.000000
25%          3.25000  2.000000   2.250000   1.000000
50%          5.50000  3.000000   4.000000   2.000000
75%          7.75000  3.000000   4.000000   3.000000
max         10.00000  7.000000   5.000000   6.000000

In [8]:
print(df['UserID'])

0    7.0
1    3.0
2    3.0
3    1.0
4    2.0
5    2.0
6    3.0
7    NaN
8    7.0
9    3.0
Name: UserID, dtype: float64

In [9]:
print(df[['UserID','TransactionID','ProductID']])

   UserID  TransactionID  ProductID
0     7.0              1          2
1     3.0              2          4
2     3.0              3          3
3     1.0              4          2
4     2.0              5          4
5     2.0              6          5
6     3.0              7          4
7     NaN              8          2
8     7.0              9          4
9     3.0             10          4

In [10]:
print(df.iloc[1])

TransactionID               2
TransactionDate    2011-05-26
UserID                    3.0
ProductID                   4
Quantity                    1
Name: 1, dtype: object

In [11]:
print(df.iloc[[7,2]])

   TransactionID TransactionDate  UserID  ProductID  Quantity
7              8      2014-04-24     NaN          2         3
2              3      2011-06-16     3.0          3         1

# Filtering Data

In [12]:
df

   TransactionID TransactionDate  UserID  ProductID  Quantity
0              1      2010-08-21     7.0          2         1
1              2      2011-05-26     3.0          4         1
2              3      2011-06-16     3.0          3         1
3              4      2012-08-26     1.0          2         3
4              5      2013-06-06     2.0          4         1
5              6      2013-12-23     2.0          5         6
6              7      2013-12-30     3.0          4         1
7              8      2014-04-24     NaN          2         3
8              9      2015-04-24     7.0          4         3
9             10      2016-05-08     3.0          4         4

In [13]:
filtered_df = df[df['ProductID']>3] 
print(filtered_df)

   TransactionID TransactionDate  UserID  ProductID  Quantity
1              2      2011-05-26     3.0          4         1
4              5      2013-06-06     2.0          4         1
5              6      2013-12-23     2.0          5         6
6              7      2013-12-30     3.0          4         1
8              9      2015-04-24     7.0          4         3
9             10      2016-05-08     3.0          4         4

# Renaming Columns

In [14]:
import pandas as pd
df = pd.read_csv("transactions.csv")
df.rename(columns={"Quantity": "Quant"}, inplace=True)
print(df.head(10))

   TransactionID TransactionDate  UserID  ProductID  Quant
0              1      2010-08-21     7.0          2      1
1              2      2011-05-26     3.0          4      1
2              3      2011-06-16     3.0          3      1
3              4      2012-08-26     1.0          2      3
4              5      2013-06-06     2.0          4      1
5              6      2013-12-23     2.0          5      6
6              7      2013-12-30     3.0          4      1
7              8      2014-04-24     NaN          2      3
8              9      2015-04-24     7.0          4      3
9             10      2016-05-08     3.0          4      4

In [15]:
df.rename(columns={"Quant":'Quantity'}, inplace=True)
print(df.head())

   TransactionID TransactionDate  UserID  ProductID  Quantity
0              1      2010-08-21     7.0          2         1
1              2      2011-05-26     3.0          4         1
2              3      2011-06-16     3.0          3         1
3              4      2012-08-26     1.0          2         3
4              5      2013-06-06     2.0          4         1

# Handling Missing Data

In [16]:
# Check for missing values
print(df.isnull().sum())

TransactionID      0
TransactionDate    0
UserID             1
ProductID          0
Quantity           0
dtype: int64

In [17]:
# Fill missing values in 'UserID' column
df['UserID'].fillna(df['UserID'].mean(), inplace=True)

In [18]:
df

   TransactionID TransactionDate    UserID  ProductID  Quantity
0              1      2010-08-21  7.000000          2         1
1              2      2011-05-26  3.000000          4         1
2              3      2011-06-16  3.000000          3         1
3              4      2012-08-26  1.000000          2         3
4              5      2013-06-06  2.000000          4         1
5              6      2013-12-23  2.000000          5         6
6              7      2013-12-30  3.000000          4         1
7              8      2014-04-24  3.444444          2         3
8              9      2015-04-24  7.000000          4         3
9             10      2016-05-08  3.000000          4         4

In [19]:
 #Drop rows with missing values
df.dropna(inplace=True)

In [20]:
df

   TransactionID TransactionDate    UserID  ProductID  Quantity
0              1      2010-08-21  7.000000          2         1
1              2      2011-05-26  3.000000          4         1
2              3      2011-06-16  3.000000          3         1
3              4      2012-08-26  1.000000          2         3
4              5      2013-06-06  2.000000          4         1
5              6      2013-12-23  2.000000          5         6
6              7      2013-12-30  3.000000          4         1
7              8      2014-04-24  3.444444          2         3
8              9      2015-04-24  7.000000          4         3
9             10      2016-05-08  3.000000          4         4

In [47]:
import pandas as pd
df = pd.read_csv("transactions.csv")
df_sorted = df.sort_values(by=["Quantity", "TransactionDate"], 
ascending=[True, False])
print(df_sorted.head(10))

   TransactionID TransactionDate  UserID  ProductID  Quantity
6              7      2013-12-30     3.0          4         1
4              5      2013-06-06     2.0          4         1
2              3      2011-06-16     3.0          3         1
1              2      2011-05-26     3.0          4         1
0              1      2010-08-21     7.0          2         1
8              9      2015-04-24     7.0          4         3
7              8      2014-04-24     NaN          2         3
3              4      2012-08-26     1.0          2         3
9             10      2016-05-08     3.0          4         4
5              6      2013-12-23     2.0          5         6

In [22]:
df_sorted = df.sort_values(by=["TransactionDate"],
ascending=False)
print(df_sorted.head(10))

   TransactionID TransactionDate  UserID  ProductID  Quantity
9             10      2016-05-08     3.0          4         4
8              9      2015-04-24     7.0          4         3
7              8      2014-04-24     NaN          2         3
6              7      2013-12-30     3.0          4         1
5              6      2013-12-23     2.0          5         6
4              5      2013-06-06     2.0          4         1
3              4      2012-08-26     1.0          2         3
2              3      2011-06-16     3.0          3         1
1              2      2011-05-26     3.0          4         1
0              1      2010-08-21     7.0          2         1

# Subsetting data

In [23]:
subset = df[df['Quantity'] > 1]
print(subset)

   TransactionID TransactionDate  UserID  ProductID  Quantity
3              4      2012-08-26     1.0          2         3
5              6      2013-12-23     2.0          5         6
7              8      2014-04-24     NaN          2         3
8              9      2015-04-24     7.0          4         3
9             10      2016-05-08     3.0          4         4

In [24]:
subset_rows = df.iloc[[0, 2, 5]] 
print(subset_rows)

   TransactionID TransactionDate  UserID  ProductID  Quantity
0              1      2010-08-21     7.0          2         1
2              3      2011-06-16     3.0          3         1
5              6      2013-12-23     2.0          5         6

In [25]:
df

   TransactionID TransactionDate  UserID  ProductID  Quantity
0              1      2010-08-21     7.0          2         1
1              2      2011-05-26     3.0          4         1
2              3      2011-06-16     3.0          3         1
3              4      2012-08-26     1.0          2         3
4              5      2013-06-06     2.0          4         1
5              6      2013-12-23     2.0          5         6
6              7      2013-12-30     3.0          4         1
7              8      2014-04-24     NaN          2         3
8              9      2015-04-24     7.0          4         3
9             10      2016-05-08     3.0          4         4

In [26]:
#Subset rows where an external array, foo, is True

foo = [True, False, True, False,True,False,True,False,True,False] # Example of a boolean array
subset_rows = df[foo]
print(subset_rows)

   TransactionID TransactionDate  UserID  ProductID  Quantity
0              1      2010-08-21     7.0          2         1
2              3      2011-06-16     3.0          3         1
4              5      2013-06-06     2.0          4         1
6              7      2013-12-30     3.0          4         1
8              9      2015-04-24     7.0          4         3

In [27]:
#Subset by columns TransactionID and TransactionDate with logical operator

subset = df[df['Quantity'] > 1][['TransactionID', 
'TransactionDate']]
print(subset)

   TransactionID TransactionDate
3              4      2012-08-26
5              6      2013-12-23
7              8      2014-04-24
8              9      2015-04-24
9             10      2016-05-08

In [28]:
#Subset columns by a variable list of column names

columns_to_select = ['TransactionID', 'TransactionDate']
subset_columns = df[columns_to_select]
print(subset_columns)

   TransactionID TransactionDate
0              1      2010-08-21
1              2      2011-05-26
2              3      2011-06-16
3              4      2012-08-26
4              5      2013-06-06
5              6      2013-12-23
6              7      2013-12-30
7              8      2014-04-24
8              9      2015-04-24
9             10      2016-05-08

In [29]:
#Subset columns excluding a variable list of column names

columns_to_exclude = ['Quantity', 'ProductID']
subset_columns_excluded = df[[col for col in df.columns if col not 
in columns_to_exclude]]
print(subset_columns_excluded)

   TransactionID TransactionDate  UserID
0              1      2010-08-21     7.0
1              2      2011-05-26     3.0
2              3      2011-06-16     3.0
3              4      2012-08-26     1.0
4              5      2013-06-06     2.0
5              6      2013-12-23     2.0
6              7      2013-12-30     3.0
7              8      2014-04-24     NaN
8              9      2015-04-24     7.0
9             10      2016-05-08     3.0

In [30]:
#Convert the TransactionDate column to type Date

'''To convert a column in a pandas DataFrame to the datetime type, 
you can use the pd.to_datetime() function.'''

df['TransactionDate'] = pd.to_datetime(df['TransactionDate']) 
print(df.dtypes)

TransactionID               int64
TransactionDate    datetime64[ns]
UserID                    float64
ProductID                   int64
Quantity                    int64
dtype: object

In [31]:
df

   TransactionID TransactionDate  UserID  ProductID  Quantity
0              1      2010-08-21     7.0          2         1
1              2      2011-05-26     3.0          4         1
2              3      2011-06-16     3.0          3         1
3              4      2012-08-26     1.0          2         3
4              5      2013-06-06     2.0          4         1
5              6      2013-12-23     2.0          5         6
6              7      2013-12-30     3.0          4         1
7              8      2014-04-24     NaN          2         3
8              9      2015-04-24     7.0          4         3
9             10      2016-05-08     3.0          4         4

In [32]:
#Insert a new column, Foo = UserID + ProductID

df['Foo'] = df['UserID'] + df['ProductID']
print(df.head(10))

   TransactionID TransactionDate  UserID  ProductID  Quantity   Foo
0              1      2010-08-21     7.0          2         1   9.0
1              2      2011-05-26     3.0          4         1   7.0
2              3      2011-06-16     3.0          3         1   6.0
3              4      2012-08-26     1.0          2         3   3.0
4              5      2013-06-06     2.0          4         1   6.0
5              6      2013-12-23     2.0          5         6   7.0
6              7      2013-12-30     3.0          4         1   7.0
7              8      2014-04-24     NaN          2         3   NaN
8              9      2015-04-24     7.0          4         3  11.0
9             10      2016-05-08     3.0          4         4   7.0

In [41]:
#Inserting a New Row

df.loc[len(df)] = [11, pd.Timestamp('2010-12-26'), 6, 5, 5,9.0]

In [44]:
#Updating Existing Values
print(df.columns)

df.loc[df['UID'] == 2, 'Quant'] = 2

Index(['TransactionID', 'TransactionDate', 'UID', 'PID', 'Quant', 'Foo'], dtype='object')

In [45]:
df

    TransactionID TransactionDate  UID  PID  Quant   Foo
0               1      2010-08-21  7.0    2      1   9.0
1               2      2011-05-26  3.0    4      1   7.0
2               3      2011-06-16  3.0    3      1   6.0
3               4      2012-08-26  1.0    2      3   3.0
4               5      2013-06-06  2.0    4      2   6.0
5               6      2013-12-23  2.0    5      2   7.0
6               7      2013-12-30  3.0    4      1   7.0
7               8      2014-04-24  NaN    2      3   NaN
8               9      2015-04-24  7.0    4      3  11.0
9              10      2016-05-08  3.0    4      4   7.0
10             11      2010-12-26  6.0    5      5   9.0

In [49]:
df.loc[df['UserID'] == 6, 'TransactionDate'] = pd.Timestamp('2010-12-26')

In [50]:
df

   TransactionID TransactionDate  UserID  ProductID  Quantity
0              1      2010-08-21     7.0          2         1
1              2      2011-05-26     3.0          4         1
2              3      2011-06-16     3.0          3         1
3              4      2012-08-26     1.0          2         3
4              5      2013-06-06     2.0          4         1
5              6      2013-12-23     2.0          5         6
6              7      2013-12-30     3.0          4         1
7              8      2014-04-24     NaN          2         3
8              9      2015-04-24     7.0          4         3
9             10      2016-05-08     3.0          4         4

In [51]:
#Inserting a New Column

df['Foo'] = df['UserID'] + df['ProductID']

# Modifying data frames

In [52]:
df['NewColumn'] = df['Quantity'] * 2
print(df.head(10))

   TransactionID TransactionDate  UserID  ProductID  Quantity   Foo  NewColumn
0              1      2010-08-21     7.0          2         1   9.0          2
1              2      2011-05-26     3.0          4         1   7.0          2
2              3      2011-06-16     3.0          3         1   6.0          2
3              4      2012-08-26     1.0          2         3   3.0          6
4              5      2013-06-06     2.0          4         1   6.0          2
5              6      2013-12-23     2.0          5         6   7.0         12
6              7      2013-12-30     3.0          4         1   7.0          2
7              8      2014-04-24     NaN          2         3   NaN          6
8              9      2015-04-24     7.0          4         3  11.0          6
9             10      2016-05-08     3.0          4         4   7.0          8

# Handling dates

In [53]:
 df['TransactionDate'] = pd.to_datetime(df['TransactionDate'])
df

   TransactionID TransactionDate  UserID  ProductID  Quantity   Foo  NewColumn
0              1      2010-08-21     7.0          2         1   9.0          2
1              2      2011-05-26     3.0          4         1   7.0          2
2              3      2011-06-16     3.0          3         1   6.0          2
3              4      2012-08-26     1.0          2         3   3.0          6
4              5      2013-06-06     2.0          4         1   6.0          2
5              6      2013-12-23     2.0          5         6   7.0         12
6              7      2013-12-30     3.0          4         1   7.0          2
7              8      2014-04-24     NaN          2         3   NaN          6
8              9      2015-04-24     7.0          4         3  11.0          6
9             10      2016-05-08     3.0          4         4   7.0          8

# Exercise questions:

In [3]:
#1. Print Summary of transaction data set

import pandas as pd
import numpy as np

df=pd.read_csv("transactions.csv")
print(df.head(10))
print(df.describe())

   TransactionID TransactionDate  UserID  ProductID  Quantity
0              1      2010-08-21     7.0          2         1
1              2      2011-05-26     3.0          4         1
2              3      2011-06-16     3.0          3         1
3              4      2012-08-26     1.0          2         3
4              5      2013-06-06     2.0          4         1
5              6      2013-12-23     2.0          5         6
6              7      2013-12-30     3.0          4         1
7              8      2014-04-24     NaN          2         3
8              9      2015-04-24     7.0          4         3
9             10      2016-05-08     3.0          4         4
       TransactionID    UserID  ProductID   Quantity
count       10.00000  9.000000  10.000000  10.000000
mean         5.50000  3.444444   3.400000   2.400000
std          3.02765  2.127858   1.074968   1.712698
min          1.00000  1.000000   2.000000   1.000000
25%          3.25000  2.000000   2.250000   1.000000
50%          5.50000  3.000000   4.000000   2.000000
75%          7.75000  3.000000   4.000000   3.000000
max         10.00000  7.000000   5.000000   6.000000

In [4]:
#2. Print Numbers of Attributes

#print("Number of attributes:", df.shape[1])

print("Number of attributes:", len(df.columns))

Number of attributes: 5

In [5]:
#3. Print Numbers of Records

print("Number of Records:", len(df))

Number of Records: 10

In [6]:
#4. Get the row names
row_names = df.index
print("Row names:", row_names)

Row names: RangeIndex(start=0, stop=10, step=1)

In [7]:
#5. Get the column names
column_names = df.columns
print("Column names:", column_names)

Column names: Index(['TransactionID', 'TransactionDate', 'UserID', 'ProductID', 'Quantity'], dtype='object')

In [8]:
#6. View top 10 Records
top_10_records = df.head(10)
print("Top 10 records:\n", top_10_records)

Top 10 records:
    TransactionID TransactionDate  UserID  ProductID  Quantity
0              1      2010-08-21     7.0          2         1
1              2      2011-05-26     3.0          4         1
2              3      2011-06-16     3.0          3         1
3              4      2012-08-26     1.0          2         3
4              5      2013-06-06     2.0          4         1
5              6      2013-12-23     2.0          5         6
6              7      2013-12-30     3.0          4         1
7              8      2014-04-24     NaN          2         3
8              9      2015-04-24     7.0          4         3
9             10      2016-05-08     3.0          4         4

In [9]:
#7.Change the name of column “ Quantity” to “Quant”
df.rename(columns={'Quantity':'Quant'}, inplace=True)
df

   TransactionID TransactionDate  UserID  ProductID  Quant
0              1      2010-08-21     7.0          2      1
1              2      2011-05-26     3.0          4      1
2              3      2011-06-16     3.0          3      1
3              4      2012-08-26     1.0          2      3
4              5      2013-06-06     2.0          4      1
5              6      2013-12-23     2.0          5      6
6              7      2013-12-30     3.0          4      1
7              8      2014-04-24     NaN          2      3
8              9      2015-04-24     7.0          4      3
9             10      2016-05-08     3.0          4      4

In [10]:
#8.Change the name of columns ProductID and UserID to PID and UID respectively

df.rename(columns={'ProductID':'PID','UserID':'UID'},inplace=True)
df

   TransactionID TransactionDate  UID  PID  Quant
0              1      2010-08-21  7.0    2      1
1              2      2011-05-26  3.0    4      1
2              3      2011-06-16  3.0    3      1
3              4      2012-08-26  1.0    2      3
4              5      2013-06-06  2.0    4      1
5              6      2013-12-23  2.0    5      6
6              7      2013-12-30  3.0    4      1
7              8      2014-04-24  NaN    2      3
8              9      2015-04-24  7.0    4      3
9             10      2016-05-08  3.0    4      4

In [11]:
#9. Order the rows of transactions by TransactionId descending, if ascending then ascending=True
# For descending order
df_sorted_desc = df.sort_values(by='TransactionID', ascending=False)
print("Sorted in descending order:\n", df_sorted_desc)

# For ascending order (if needed, you can set ascending=True)
df_sorted_asc = df.sort_values(by='TransactionID', ascending=True)
print("Sorted in ascending order:\n", df_sorted_asc)

Sorted in descending order:
    TransactionID TransactionDate  UID  PID  Quant
9             10      2016-05-08  3.0    4      4
8              9      2015-04-24  7.0    4      3
7              8      2014-04-24  NaN    2      3
6              7      2013-12-30  3.0    4      1
5              6      2013-12-23  2.0    5      6
4              5      2013-06-06  2.0    4      1
3              4      2012-08-26  1.0    2      3
2              3      2011-06-16  3.0    3      1
1              2      2011-05-26  3.0    4      1
0              1      2010-08-21  7.0    2      1
Sorted in ascending order:
    TransactionID TransactionDate  UID  PID  Quant
0              1      2010-08-21  7.0    2      1
1              2      2011-05-26  3.0    4      1
2              3      2011-06-16  3.0    3      1
3              4      2012-08-26  1.0    2      3
4              5      2013-06-06  2.0    4      1
5              6      2013-12-23  2.0    5      6
6              7      2013-12-30  3.0    4      1
7              8      2014-04-24  NaN    2      3
8              9      2015-04-24  7.0    4      3
9             10      2016-05-08  3.0    4      4

In [12]:
#10. Order the rows of transactions by Quantity ascending, TransactionDate descending
df_sorted = df.sort_values(by=["Quant", "TransactionDate"], 
ascending=[True, False])
print(df_sorted.head(10))

   TransactionID TransactionDate  UID  PID  Quant
6              7      2013-12-30  3.0    4      1
4              5      2013-06-06  2.0    4      1
2              3      2011-06-16  3.0    3      1
1              2      2011-05-26  3.0    4      1
0              1      2010-08-21  7.0    2      1
8              9      2015-04-24  7.0    4      3
7              8      2014-04-24  NaN    2      3
3              4      2012-08-26  1.0    2      3
9             10      2016-05-08  3.0    4      4
5              6      2013-12-23  2.0    5      6

In [13]:
#11. Set the column order of Transactions as ProductID, Quantity, TransactionDate, TransactionID, UserID
df_sorted_column=df[sorted(df.columns)]
print(df_sorted_column)

   PID  Quant TransactionDate  TransactionID  UID
0    2      1      2010-08-21              1  7.0
1    4      1      2011-05-26              2  3.0
2    3      1      2011-06-16              3  3.0
3    2      3      2012-08-26              4  1.0
4    4      1      2013-06-06              5  2.0
5    5      6      2013-12-23              6  2.0
6    4      1      2013-12-30              7  3.0
7    2      3      2014-04-24              8  NaN
8    4      3      2015-04-24              9  7.0
9    4      4      2016-05-08             10  3.0

In [17]:
#12. Make UserID the first column of transactions
df = df.set_index('UID').reset_index()
print(df)

   UID  TransactionID TransactionDate  PID  Quant
0  7.0              1      2010-08-21    2      1
1  3.0              2      2011-05-26    4      1
2  3.0              3      2011-06-16    3      1
3  1.0              4      2012-08-26    2      3
4  2.0              5      2013-06-06    4      1
5  2.0              6      2013-12-23    5      6
6  3.0              7      2013-12-30    4      1
7  NaN              8      2014-04-24    2      3
8  7.0              9      2015-04-24    4      3
9  3.0             10      2016-05-08    4      4

In [18]:
#13. Extracting arrays from a Data Frame. Get the 2nd column
second_column = df.iloc[:, 1]
print(second_column)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
Name: TransactionID, dtype: int64

In [20]:
#14. Get the ProductID Array
print(df.loc[:,"PID"])

0    2
1    4
2    3
3    2
4    4
5    5
6    4
7    2
8    4
9    4
Name: PID, dtype: int64

In [22]:
#15. Get the ProductId array using the following variable
product_id_array = df["PID"].to_numpy()
print(product_id_array)

[2 4 3 2 4 5 4 2 4 4]

In [23]:
#16.Row subsetting, subset rows 1,3 and 6
subset_rows_1_3_6 = df.iloc[[1, 3, 6]]
print(subset_rows_1_3_6)

   UID  TransactionID TransactionDate  PID  Quant
1  3.0              2      2011-05-26    4      1
3  1.0              4      2012-08-26    2      3
6  3.0              7      2013-12-30    4      1

In [24]:
#17. subset rows excluding 1,3 and 6
subset_rows_excluding_1_3_6 = df.drop([1,3,6])
print(subset_rows_excluding_1_3_6)

   UID  TransactionID TransactionDate  PID  Quant
0  7.0              1      2010-08-21    2      1
2  3.0              3      2011-06-16    3      1
4  2.0              5      2013-06-06    4      1
5  2.0              6      2013-12-23    5      6
7  NaN              8      2014-04-24    2      3
8  7.0              9      2015-04-24    4      3
9  3.0             10      2016-05-08    4      4

In [25]:
#18. Subset the first three rows
subset_first_three_rows = df.head(3)
print(subset_first_three_rows)

   UID  TransactionID TransactionDate  PID  Quant
0  7.0              1      2010-08-21    2      1
1  3.0              2      2011-05-26    4      1
2  3.0              3      2011-06-16    3      1

In [26]:
#19. Subset the last 2 rows
subset_last_two_rows = df.tail(2)
print(subset_last_two_rows)

   UID  TransactionID TransactionDate  PID  Quant
8  7.0              9      2015-04-24    4      3
9  3.0             10      2016-05-08    4      4

In [27]:
#20. Subset rows excluding the last 2 rows
subset_excluding_last_two = df.iloc[:-2]
print(subset_excluding_last_two)

   UID  TransactionID TransactionDate  PID  Quant
0  7.0              1      2010-08-21    2      1
1  3.0              2      2011-05-26    4      1
2  3.0              3      2011-06-16    3      1
3  1.0              4      2012-08-26    2      3
4  2.0              5      2013-06-06    4      1
5  2.0              6      2013-12-23    5      6
6  3.0              7      2013-12-30    4      1
7  NaN              8      2014-04-24    2      3

In [28]:
#21. Subset rows excluding the first 3 rows
subset_excluding_first_three = df.iloc[3:]
print(subset_excluding_first_three)

   UID  TransactionID TransactionDate  PID  Quant
3  1.0              4      2012-08-26    2      3
4  2.0              5      2013-06-06    4      1
5  2.0              6      2013-12-23    5      6
6  3.0              7      2013-12-30    4      1
7  NaN              8      2014-04-24    2      3
8  7.0              9      2015-04-24    4      3
9  3.0             10      2016-05-08    4      4

In [30]:
#22. Subset rows where Quantity>1
subset_quantity_greater_than_1 = df[df["Quant"] > 1]
print(subset_quantity_greater_than_1)

   UID  TransactionID TransactionDate  PID  Quant
3  1.0              4      2012-08-26    2      3
5  2.0              6      2013-12-23    5      6
7  NaN              8      2014-04-24    2      3
8  7.0              9      2015-04-24    4      3
9  3.0             10      2016-05-08    4      4

In [32]:
#23. Subset rows where UserID=2
subset_userid_2 = df[df["UID"] == 2]
print(subset_userid_2)

   UID  TransactionID TransactionDate  PID  Quant
4  2.0              5      2013-06-06    4      1
5  2.0              6      2013-12-23    5      6

In [33]:
#24. Subset rows where Quantity>1 and UserID=2

df = pd.read_csv("transactions.csv")
print(df[(df["Quantity"] > 1)&(df["UserID"] == 2)])

   TransactionID TransactionDate  UserID  ProductID  Quantity
5              6      2013-12-23     2.0          5         6

In [34]:
#25. Subset rows where Quantity + UserID is >3
print(df[(df["Quantity"] + df["UserID"])>3])

   TransactionID TransactionDate  UserID  ProductID  Quantity
0              1      2010-08-21     7.0          2         1
1              2      2011-05-26     3.0          4         1
2              3      2011-06-16     3.0          3         1
3              4      2012-08-26     1.0          2         3
5              6      2013-12-23     2.0          5         6
6              7      2013-12-30     3.0          4         1
8              9      2015-04-24     7.0          4         3
9             10      2016-05-08     3.0          4         4

In [39]:
#26. Subset rows where an external array, foo, is True
foo = [True, False, True, True, False, True, False, True, False, True]

subset_foo_true = df[foo]
print(subset_foo_true)

   TransactionID TransactionDate  UserID  ProductID  Quantity
0              1      2010-08-21     7.0          2         1
2              3      2011-06-16     3.0          3         1
3              4      2012-08-26     1.0          2         3
5              6      2013-12-23     2.0          5         6
7              8      2014-04-24     NaN          2         3
9             10      2016-05-08     3.0          4         4

In [40]:
#27. Subset rows where an external array, bar, is positive

bar = np.array([1, -2, 3, 4, -5, 6, -7, 8, 9, -10])

mask = bar > 0

subset_bar_positive = df[mask]
print(subset_bar_positive)

   TransactionID TransactionDate  UserID  ProductID  Quantity
0              1      2010-08-21     7.0          2         1
2              3      2011-06-16     3.0          3         1
3              4      2012-08-26     1.0          2         3
5              6      2013-12-23     2.0          5         6
7              8      2014-04-24     NaN          2         3
8              9      2015-04-24     7.0          4         3

In [62]:
# 28. Subset rows where foo is TRUE or bar is negative
print(df[foo | (bar < 0)])

   TransactionID TransactionDate  UserID  ProductID  Quantity     NewColumn  \
0              1      2010-08-21     7.0          2         1  DefaultValue
1              2      2011-05-26     3.0          4         1  DefaultValue
2              3      2011-06-16     3.0          3         1  DefaultValue
3              4      2012-08-26     1.0          2         3  DefaultValue
4              5      2013-06-06     2.0          4        10  DefaultValue
5              6      2013-12-23     2.0          5         6  DefaultValue
6              7      2013-12-30     3.0          4         1  DefaultValue
7              8      2014-04-24     NaN          2         3  DefaultValue
9             10      2016-05-08     3.0          4         4  DefaultValue

   Foo
0  9.0
1  7.0
2  6.0
3  3.0
4  6.0
5  7.0
6  7.0
7  2.0
9  7.0

In [64]:

# 29. Subset where foo is not True and bar is not negative
print(df[np.array(foo) & (bar >= 0)])

   TransactionID TransactionDate  UserID  ProductID  Quantity     NewColumn  \
0              1      2010-08-21     7.0          2         1  DefaultValue
2              3      2011-06-16     3.0          3         1  DefaultValue
3              4      2012-08-26     1.0          2         3  DefaultValue
5              6      2013-12-23     2.0          5         6  DefaultValue
7              8      2014-04-24     NaN          2         3  DefaultValue

   Foo
0  9.0
2  6.0
3  3.0
5  7.0
7  2.0

In [66]:
# 30. Subset by columns 1 and 3
print(df.iloc[:, [1, 3]])

  TransactionDate  ProductID
0      2010-08-21          2
1      2011-05-26          4
2      2011-06-16          3
3      2012-08-26          2
4      2013-06-06          4
5      2013-12-23          5
6      2013-12-30          4
7      2014-04-24          2
8      2015-04-24          4
9      2016-05-08          4

In [68]:
# 31. Subset by TransactionID and TransactionDate
print(df[['TransactionID', 'TransactionDate']])

   TransactionID TransactionDate
0              1      2010-08-21
1              2      2011-05-26
2              3      2011-06-16
3              4      2012-08-26
4              5      2013-06-06
5              6      2013-12-23
6              7      2013-12-30
7              8      2014-04-24
8              9      2015-04-24
9             10      2016-05-08

In [74]:
# 32. Subset by TransactionID and TransactionDate using logical operator
columns_to_subset = ['TransactionID', 'TransactionDate']
print(df[columns_to_subset])
df

   TransactionID TransactionDate
0              1      2010-08-21
1              2      2011-05-26
2              3      2011-06-16
3              4      2012-08-26
4              5      2013-06-06
5              6      2013-12-23
6              7      2013-12-30
7              8      2014-04-24
8              9      2015-04-24
9             10      2016-05-08

,TransactionID,TransactionDate,UserID,ProductID,Quantity,NewColumn,Foo
0,1,2010-08-21,7.0,2,1,DefaultValue,9.0
1,2,2011-05-26,3.0,4,1,DefaultValue,7.0
2,3,2011-06-16,3.0,3,1,DefaultValue,6.0
3,4,2012-08-26,1.0,2,3,DefaultValue,3.0
4,5,2013-06-06,2.0,4,10,DefaultValue,6.0
5,6,2013-12-23,2.0,5,6,DefaultValue,7.0
6,7,2013-12-30,3.0,4,1,DefaultValue,7.0
7,8,2014-04-24,NaN,2,3,DefaultValue,2.0
8,9,2015-04-24,7.0,4,3,DefaultValue,11.0
9,10,2016-05-08,3.0,4,4,DefaultValue,7.0

In [76]:
# 33. Subset columns by variable list
var_list = ['ProductID', 'Quantity']
print(df[var_list])

   ProductID  Quantity
0          2         1
1          4         1
2          3         1
3          2         3
4          4        10
5          5         6
6          4         1
7          2         3
8          4         3
9          4         4

In [78]:
# 34. Subset columns excluding variable list
excluded_list = ['ProductID', 'Quantity']
print(df.drop(columns=excluded_list))

   TransactionID TransactionDate  UserID     NewColumn   Foo
0              1      2010-08-21     7.0  DefaultValue   9.0
1              2      2011-05-26     3.0  DefaultValue   7.0
2              3      2011-06-16     3.0  DefaultValue   6.0
3              4      2012-08-26     1.0  DefaultValue   3.0
4              5      2013-06-06     2.0  DefaultValue   6.0
5              6      2013-12-23     2.0  DefaultValue   7.0
6              7      2013-12-30     3.0  DefaultValue   7.0
7              8      2014-04-24     NaN  DefaultValue   2.0
8              9      2015-04-24     7.0  DefaultValue  11.0
9             10      2016-05-08     3.0  DefaultValue   7.0

In [80]:
# 35. Inserting and updating values
df.loc[0, 'Quant'] = 99  

df

,TransactionID,TransactionDate,UserID,ProductID,Quantity,NewColumn,Foo,Quant
0,1,2010-08-21,7.0,2,1,DefaultValue,9.0,99.0
1,2,2011-05-26,3.0,4,1,DefaultValue,7.0,NaN
2,3,2011-06-16,3.0,3,1,DefaultValue,6.0,NaN
3,4,2012-08-26,1.0,2,3,DefaultValue,3.0,NaN
4,5,2013-06-06,2.0,4,10,DefaultValue,6.0,NaN
5,6,2013-12-23,2.0,5,6,DefaultValue,7.0,NaN
6,7,2013-12-30,3.0,4,1,DefaultValue,7.0,NaN
7,8,2014-04-24,NaN,2,3,DefaultValue,2.0,NaN
8,9,2015-04-24,7.0,4,3,DefaultValue,11.0,NaN
9,10,2016-05-08,3.0,4,4,DefaultValue,7.0,NaN

In [85]:
# 36. Convert TransactionDate to Date type
df['TransactionDate'] = pd.to_datetime(df['TransactionDate'])
print(df['TransactionDate'].dtype)

datetime64[ns]

In [82]:
# 37. Insert new column Foo = UserID + ProductID
df['Foo'] = df['UserID'] + df['ProductID']

print(df.head())

   TransactionID TransactionDate  UserID  ProductID  Quantity     NewColumn  \
0              1      2010-08-21     7.0          2         1  DefaultValue
1              2      2011-05-26     3.0          4         1  DefaultValue
2              3      2011-06-16     3.0          3         1  DefaultValue
3              4      2012-08-26     1.0          2         3  DefaultValue
4              5      2013-06-06     2.0          4        10  DefaultValue

   Foo  Quant
0  9.0   99.0
1  7.0    NaN
2  6.0    NaN
3  3.0    NaN
4  6.0    NaN